{
  
    "Environment": {
      "Sustainability Risks & Opportunities": [ 
        { "question": "Has the company identified any environmental risks that could affect its business?", "type": "boolean" },
        { "question": "List the key environmental risks identified", "type": "text" },
        
        { "question": "Has the company identified any social risks that could affect its business?", "type": "boolean" },
        { "question": "List the key social risks identified", "type": "text" },
    
        { "question": "Has the company identified any governance-related risks?", "type": "boolean" },
        { "question": "List the key governance risks identified", "type": "text" },
    
        { "question": "Has the company identified any ESG-related opportunities?", "type": "boolean" },
        { "question": "List the key ESG-related business opportunities identified", "type": "text" },
    
        { "question": "Does the company have a documented process to assess ESG risks and opportunities?", "type": "boolean" },
        { "question": "Are ESG risks integrated into the overall business risk management strategy?", "type": "boolean" },
    
        { "question": "Who in the company is responsible for managing ESG risks?", "type": "text" }
      ]
    },
    
    "EPR":{
      "Extended Producer Responsibility (EPR) Plan":[
        {"question":"Does your company have an Extended Producer Responsibility plan in place? – If yes, please describe the collection system, processing practices, and measures taken to ensure compliance.","type":"text"}
      ]
        },
        "LCA": {
          "Life Cycle Assessment (LCA) Details": [
            {
              "question": "Have you conducted a Life Cycle Assessment for any of your major products or services?   – Please specify the assessment boundary (cradle-to-grave, cradle-to-gate, etc.), key environmental impacts identified, and improvement actions.",
              "type": "text"
            }
          ]
        },
        "EIA": {
          "Environmental Impact Assessment": [
            {
              "question": "Has your company carried out an Environmental Impact Assessment (EIA) for your operations?   – Describe the methodology used, key findings, and any mitigation or adaptation measures implemented.",
              "type": "text"
            }
          ]
        },
        "Waste Management Practices": {
          "Waste Management Practices": [
            {
              "question": "What are your detailed waste management practices?   – Provide data on total waste generated, breakdown by disposal method (landfill, incineration, recycling, composting), and any related emission factors.",
              "type": "text"
            }
          ]
        },
        "Impact on Biodiversity": {
          "Impact on Biodiversity": [
            {
              "question": "Do your operations have any impact on biodiversity?  – If yes, detail the locations and extent of impact (e.g., habitat alteration, species affected), and outline any conservation or restoration initiatives.",
              "type": "text"
            }
          ]
        },
        "PAT Scheme": {
          "PAT Scheme Performance": [
            {
              "question": " Are any of your facilities designated under the Government’s Perform, Achieve and Trade (PAT) scheme?  – If yes, please provide information on targets, improvements in energy efficiency, and performance outcomes.",
              "type": "text"
            }
          ]
        },
        "Reclaimed Products & Packaging": {
          "Reclaimed Products & Packaging": [
            {
              "question": " What proportion of your products (and/or packaging materials) are reclaimed (reused, recycled, or disposed of safely) relative to total products sold?   – Describe the process and calculation methodology.",
              "type": "text"
            }
          ]
        }
}