{

    "Social": {
        "Workforce Composition & Diversity(Management & HR Data)": [
          
            { "question": "Total number of employees?", "type": "number" },
            { "question": "Breakdown of employees by gender?", "type": "text" },
            { "question": "Breakdown of employees by employment type?", "type": "text" },
            { "question": "Diversity ratio in leadership positions?", "type": "text" },
            { "question": "Does the company have a diversity & inclusion policy?", "type": "boolean" },
            { "question": "Percentage of employees from minority or underrepresented communities?", "type": "text" },
            { "question": "Does the company have equal opportunity hiring practices?", "type": "boolean" },
            { "question": "Is there an anti-discrimination and harassment policy?", "type": "boolean" },
            { "question": "Have there been any reported cases of workplace discrimination or harassment in the last year?", "type": "boolean" }
          ],
        
        "Employee Well-being & Benefits(Employee Survey via GoodFoot)": [
          
            { "question": "How satisfied are you with your work-life balance?", "type": "text" },
            { "question": "Do you receive paid leave, maternity/paternity leave, and sick leave?", "type": "boolean" },
            { "question": "Does the company offer health insurance benefits?", "type": "boolean" },
            { "question": "Do you feel that your workplace provides mental health support?", "type": "boolean" },
            { "question": "Does your company offer employee assistance programs (EAPs)?", "type": "boolean" },
            { "question": "Does your workplace support flexible work arrangements (remote/hybrid)?", "type": "boolean" },
            {"question": "Does your company have safety policies and training in place?", "type": "boolean" }
          ],
        
        "Training & Career Development(HR & Employee Survey via GoodFoot)": [
         
            { "question": "How many hours of training does each employee receive annually?", "type": "text" },
            { "question": "Does the company have a structured career development plan?", "type": "boolean" },
            { "question": "Does the company offer mentorship programs?", "type": "boolean" },
            { "question": "How often do employees receive performance evaluations?", "type": "text" },
            { "question": "Do employees receive support for further education/certifications?", "type": "boolean" }
          ],
    
       
          "Employee Health & Safety (Management & Compliance Data)": [
            { "question": "Has the company reported any workplace injuries or fatalities in the last year?", "type": "boolean" },
            { "question": "Does the company conduct regular health and safety audits?", "type": "boolean" },
            { "question": "Are there first-aid facilities available on-site?", "type": "boolean" },
            { "question": "Does the company have a disaster preparedness plan?", "type": "boolean" },
            { "question": "What is the frequency of fire and emergency drills?", "type": "text" },
            { "question": "Does the company provide Personal Protective Equipment (PPE) to employees?", "type": "boolean" }
          ],
    
      
          "Human Rights & Fair Wages (Management & HR Data)": [
            { "question": "Does the company ensure no child labor or forced labor in operations?", "type": "boolean" },
            { "question": "What is the minimum wage for employees?", "type": "text" },
            { "question": "Does the company ensure gender pay equity?", "type": "boolean" },
            { "question": "Are third-party suppliers audited for ethical labor practices?", "type": "boolean" },
            { "question": "Does the company support freedom of association and unionization?", "type": "boolean" }
          ],
        
    
          "Community Development & CSR (Management Data)": [
            { "question": "Does the company have a Corporate Social Responsibility (CSR) policy?", "type": "boolean" },
            { "question": "How much did the company spend on CSR initiatives in the last financial year?", "type": "text" },
            { "question": "What are the key focus areas of CSR?", "type": "text" },
            { "question": "How many people were directly impacted by CSR programs?", "type": "text" }
          ],
        
      
          "Ethical Supply Chain & Procurement (Management & Vendor Data)": [
            { "question": "Does the company have a sustainable procurement policy?", "type": "boolean" },
            { "question": "What percentage of suppliers comply with ethical labor and environmental standards?", "type": "text" },
            { "question": "Are suppliers audited for human rights compliance?", "type": "boolean" },
            { "question": "Are procurement decisions influenced by social and environmental considerations?", "type": "boolean" }
          ],
     
       
          "Customer Responsibility & Data Privacy (Management & IT Data)": [
            { "question": "Does the company have a data protection and privacy policy?", "type": "boolean" },
            { "question": "Has there been any data breach incident in the last year?", "type": "boolean" },
            { "question": "Does the company provide clear product labeling and ethical advertising?", "type": "boolean" },
            { "question": "Does the company have customer grievance redressal mechanisms?", "type": "boolean" },
            { "question": "What is the company’s Net Promoter Score (NPS) for customer satisfaction?", "type": "text" }
          ],
    
       
          "Employee Engagement & Workplace Culture (Employee Survey via GoodFoot)": [
            { "question": "Do you feel valued at work?", "type": "boolean" },
            { "question": "Does your company encourage employee volunteering?", "type": "boolean" },
            { "question": "How often does the company conduct employee engagement activities?", "type": "text" },
            { "question": "Would you recommend your company as a great place to work?", "type": "boolean" }
          ],
    
    
          "ESG & Climate Awareness (Employee Survey via GoodFoot & Management)": [
            { "question": "Does the company provide training on sustainability and ESG goals?", "type": "boolean" },
            { "question": "Are employees aware of their role in reducing the company’s carbon footprint?", "type": "boolean" },
            { "question": "Does the company encourage green commuting (carpooling, EVs, biking)?", "type": "boolean" }
          ],
          "Grievance Redressal Mechanism for Stakeholders":[
            {"question":"What structured mechanisms are in place to address grievances from various stakeholder groups (including employees, communities, suppliers, and customers)?   – Describe the process, accessibility, channels, and any quantitative data on grievances received and resolved.","type":"text"}
          ],
          "Product Safety & Recalls":[
            {"question":"Have there been any instances of product recalls on account of safety issues? – If yes, please provide details on the number of recalls, reasons for the recall, remedial actions taken, and any customer compensation measures.","type":"text"}
          ],
          "Channels for Accessing Product Information":[
            {"question":"Through which channels or platforms can stakeholders access detailed and updated information about your goods and services? – List your official website, mobile apps, social media pages, e‑commerce portals, or customer helplines. Include details on language availability or accessibility features if applicable.","type":"text"}
          ],
          "Director’s Statement on ESG (Social Focus)":[
            {"question":"Please provide the statement from the director responsible for the ESG report. – The statement should outline your company’s social vision, key priorities, challenges, and performance highlights for the reporting period.","type":"text"}
          ],
          "Details of Fines, Penalties, Awards, & Settlements":[
            {"question":"Has your company incurred any fines, penalties, received awards, or entered into settlements related to social or ethical issues during the reporting period?  – Provide amounts, reasons, and any corrective actions taken.","type":"text"}
          ],
          "Overview of Material Responsible Business Conduct Issues":[
            {"question":"What are the major social risks and opportunities related to responsible business conduct?   – Explain the nature of these issues, their potential impact on your business, and any mitigation strategies in place.","type":"text"}
          ],
          "Social Impact Assessments (SIA)":[
            {"question":"Have you conducted Social Impact Assessments for any projects or operational changes?  – Describe the methodologies, key findings, and how the insights have informed your policies or practices.","type":"text"}
          ],
          "Public Policy Positions on ESG Matters":[
            {"question":"Does your company advocate specific public policy positions related to social or sustainability issues?  – If yes, detail the positions, the rationale behind them, and any active engagement with policymakers.","type":"text"}
          ]
        }
}